org/domain-email.org
#+SETUPFILE: ./hugo_setup.org
#+TITLE: 域名邮箱
#+DATE: <2021-12-17 Fri>
https://antfu.me/posts/domain-email

一直以来都很想要一个域名邮箱，现在终于有了。域地址名：me@yidajiabei.xyz。

使用 [[https://forwardemail.net/en]]（支持 GitHub 登录），只需要添加 3 条 DNS 记录：

#+BEGIN_SRC text
MX   @  mx1.forwardemail.net  10
MX   @  mx2.forwardemail.net  10
TXT  @  forward-email=me:youremail@example.com
#+END_SRC

10 是优先级，me 则表示 =me@yidajiabei.xyz= ，当向该域名邮箱发送邮件时，邮件会被转发至 =youremail@example.com= 。

2022-01-13 更新：

Cloudflare 提供一种名为 [[https://blog.cloudflare.com/introducing-email-routing/][Email Routing]] 的服务，很久之前加入内测，今天可以使用了。它的作用和 Forward Email 一样，就是把域名邮箱转发到另一个邮箱。