blog/2021/domain-email.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-08 Tue 10:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>域名邮箱</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">域名邮箱</h1>
</header><p>
<a href="https://antfu.me/posts/domain-email">https://antfu.me/posts/domain-email</a>
</p>

<p>
一直以来都很想要一个域名邮箱，现在终于有了。域地址名：me@yidajiabei.xyz。
</p>

<p>
使用 <a href="https://forwardemail.net/en">https://forwardemail.net/en</a>（支持 GitHub 登录），只需要添加 3 条 DNS 记录：
</p>

<div class="org-src-container">
<pre class="src src-text">MX   @  mx1.forwardemail.net  10
MX   @  mx2.forwardemail.net  10
TXT  @  forward-email=me:youremail@example.com
</pre>
</div>

<p>
10 是优先级，me 则表示 <code>me@yidajiabei.xyz</code> ，当向该域名邮箱发送邮件时，邮件会被转发至 <code>youremail@example.com</code> 。
</p>

<p>
2022-01-13 更新：
</p>

<p>
Cloudflare 提供一种名为 <a href="https://blog.cloudflare.com/introducing-email-routing/">Email Routing</a> 的服务，很久之前加入内测，今天可以使用了。它的作用和 Forward Email 一样，就是把域名邮箱转发到另一个邮箱。</p>
</div>
</body>
</html>